zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_prcm.h
// Field:     [2] RCOSCLFIM
//
// 0: Disable interrupt generation when RCOSCLF is qualified
// 1: Enable interrupt generation when RCOSCLF is qualified
#define PRCM_OSCIMSC_RCOSCLFIM                                      0x00000004
#define PRCM_OSCIMSC_RCOSCLFIM_BITN                                          2
#define PRCM_OSCIMSC_RCOSCLFIM_M                                    0x00000004
#define PRCM_OSCIMSC_RCOSCLFIM_S                                             2

// Field:     [1] XOSCHFIM
//
// 0: Disable interrupt generation when XOSCHF is qualified
// 1: Enable interrupt generation when XOSCHF is qualified
#define PRCM_OSCIMSC_XOSCHFIM                                       0x00000002
#define PRCM_OSCIMSC_XOSCHFIM_BITN                                           1
#define PRCM_OSCIMSC_XOSCHFIM_M                                     0x00000002
#define PRCM_OSCIMSC_XOSCHFIM_S                                              1

// Field:     [0] RCOSCHFIM
//
// 0: Disable interrupt generation when RCOSCHF is qualified
// 1: Enable interrupt generation when RCOSCHF is qualified
#define PRCM_OSCIMSC_RCOSCHFIM                                      0x00000001
#define PRCM_OSCIMSC_RCOSCHFIM_BITN                                          0
#define PRCM_OSCIMSC_RCOSCHFIM_M                                    0x00000001
#define PRCM_OSCIMSC_RCOSCHFIM_S                                             0

//*****************************************************************************
//
// Register: PRCM_O_OSCRIS
//
//*****************************************************************************
// Field:     [7] HFSRCPENDRIS
//
// 0: HFSRCPEND has not been qualified
// 1: HFSRCPEND has been qualified since last clear
//
// Interrupt is qualified regardless of OSCIMSC.HFSRCPENDIM setting. The order
// of qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.HFSRCPENDC
#define PRCM_OSCRIS_HFSRCPENDRIS                                    0x00000080
#define PRCM_OSCRIS_HFSRCPENDRIS_BITN                                        7
#define PRCM_OSCRIS_HFSRCPENDRIS_M                                  0x00000080
#define PRCM_OSCRIS_HFSRCPENDRIS_S                                           7

// Field:     [6] LFSRCDONERIS
//
// 0: LFSRCDONE has not been qualified
// 1: LFSRCDONE has been qualified since last clear
//
// Interrupt is qualified regardless of OSCIMSC.LFSRCDONEIM setting. The order
// of qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.LFSRCDONEC
#define PRCM_OSCRIS_LFSRCDONERIS                                    0x00000040
#define PRCM_OSCRIS_LFSRCDONERIS_BITN                                        6
#define PRCM_OSCRIS_LFSRCDONERIS_M                                  0x00000040
#define PRCM_OSCRIS_LFSRCDONERIS_S                                           6

// Field:     [5] XOSCDLFRIS
//
// 0: XOSCDLF has not been qualified
// 1: XOSCDLF has been qualified since last clear.
//
// Interrupt is qualified regardless of OSCIMSC.XOSCDLFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.XOSCDLFC
#define PRCM_OSCRIS_XOSCDLFRIS                                      0x00000020
#define PRCM_OSCRIS_XOSCDLFRIS_BITN                                          5
#define PRCM_OSCRIS_XOSCDLFRIS_M                                    0x00000020
#define PRCM_OSCRIS_XOSCDLFRIS_S                                             5

// Field:     [4] XOSCLFRIS
//
// 0: XOSCLF has not been qualified
// 1: XOSCLF has been qualified since last clear.
//
// Interrupt is qualified regardless of OSCIMSC.XOSCLFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.XOSCLFC
#define PRCM_OSCRIS_XOSCLFRIS                                       0x00000010
#define PRCM_OSCRIS_XOSCLFRIS_BITN                                           4
#define PRCM_OSCRIS_XOSCLFRIS_M                                     0x00000010
#define PRCM_OSCRIS_XOSCLFRIS_S                                              4

// Field:     [3] RCOSCDLFRIS
//
// 0: RCOSCDLF has not been qualified
// 1: RCOSCDLF has been qualified since last clear.
//
// Interrupt is qualified regardless of OSCIMSC.RCOSCDLFIM setting. The order
// of qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.RCOSCDLFC
#define PRCM_OSCRIS_RCOSCDLFRIS                                     0x00000008
#define PRCM_OSCRIS_RCOSCDLFRIS_BITN                                         3
#define PRCM_OSCRIS_RCOSCDLFRIS_M                                   0x00000008
#define PRCM_OSCRIS_RCOSCDLFRIS_S                                            3

// Field:     [2] RCOSCLFRIS
//
// 0: RCOSCLF has not been qualified
// 1: RCOSCLF has been qualified since last clear.
//
// Interrupt is qualified regardless of OSCIMSC.RCOSCLFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.RCOSCLFC
#define PRCM_OSCRIS_RCOSCLFRIS                                      0x00000004
#define PRCM_OSCRIS_RCOSCLFRIS_BITN                                          2
#define PRCM_OSCRIS_RCOSCLFRIS_M                                    0x00000004
#define PRCM_OSCRIS_RCOSCLFRIS_S                                             2

// Field:     [1] XOSCHFRIS
//
// 0: XOSCHF has not been qualified
// 1: XOSCHF has been qualified since last clear.
//
// Interrupt is qualified regardless of OSCIMSC.XOSCHFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.XOSCHFC
#define PRCM_OSCRIS_XOSCHFRIS                                       0x00000002
#define PRCM_OSCRIS_XOSCHFRIS_BITN                                           1
#define PRCM_OSCRIS_XOSCHFRIS_M                                     0x00000002
#define PRCM_OSCRIS_XOSCHFRIS_S                                              1

// Field:     [0] RCOSCHFRIS
//
// 0: RCOSCHF has not been qualified
// 1: RCOSCHF has been qualified since last clear.
//
// Interrupt is qualified regardless of OSCIMSC.RCOSCHFIM setting. The order of
// qualifying raw interrupt and enable of interrupt mask is indifferent for
// generating an OSC Interrupt.
//
// Set by HW. Cleared by writing to OSCICR.RCOSCHFC
#define PRCM_OSCRIS_RCOSCHFRIS                                      0x00000001
#define PRCM_OSCRIS_RCOSCHFRIS_BITN                                          0
#define PRCM_OSCRIS_RCOSCHFRIS_M                                    0x00000001
#define PRCM_OSCRIS_RCOSCHFRIS_S                                             0

//*****************************************************************************
//
// Register: PRCM_O_OSCICR
//
//*****************************************************************************
// Field:     [7] HFSRCPENDC
//
// Writing 1 to this field clears the HFSRCPEND raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_HFSRCPENDC                                      0x00000080
#define PRCM_OSCICR_HFSRCPENDC_BITN                                          7
#define PRCM_OSCICR_HFSRCPENDC_M                                    0x00000080
#define PRCM_OSCICR_HFSRCPENDC_S                                             7

// Field:     [6] LFSRCDONEC
//
// Writing 1 to this field clears the LFSRCDONE raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_LFSRCDONEC                                      0x00000040
#define PRCM_OSCICR_LFSRCDONEC_BITN                                          6
#define PRCM_OSCICR_LFSRCDONEC_M                                    0x00000040
#define PRCM_OSCICR_LFSRCDONEC_S                                             6

// Field:     [5] XOSCDLFC
//
// Writing 1 to this field clears the XOSCDLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_XOSCDLFC                                        0x00000020
#define PRCM_OSCICR_XOSCDLFC_BITN                                            5
#define PRCM_OSCICR_XOSCDLFC_M                                      0x00000020
#define PRCM_OSCICR_XOSCDLFC_S                                               5

// Field:     [4] XOSCLFC
//
// Writing 1 to this field clears the XOSCLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_XOSCLFC                                         0x00000010
#define PRCM_OSCICR_XOSCLFC_BITN                                             4
#define PRCM_OSCICR_XOSCLFC_M                                       0x00000010
#define PRCM_OSCICR_XOSCLFC_S                                                4

// Field:     [3] RCOSCDLFC
//
// Writing 1 to this field clears the RCOSCDLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_RCOSCDLFC                                       0x00000008
#define PRCM_OSCICR_RCOSCDLFC_BITN                                           3
#define PRCM_OSCICR_RCOSCDLFC_M                                     0x00000008
#define PRCM_OSCICR_RCOSCDLFC_S                                              3

// Field:     [2] RCOSCLFC
//
// Writing 1 to this field clears the RCOSCLF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_RCOSCLFC                                        0x00000004
#define PRCM_OSCICR_RCOSCLFC_BITN                                            2
#define PRCM_OSCICR_RCOSCLFC_M                                      0x00000004
#define PRCM_OSCICR_RCOSCLFC_S                                               2

// Field:     [1] XOSCHFC
//
// Writing 1 to this field clears the XOSCHF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_XOSCHFC                                         0x00000002
#define PRCM_OSCICR_XOSCHFC_BITN                                             1
#define PRCM_OSCICR_XOSCHFC_M                                       0x00000002
#define PRCM_OSCICR_XOSCHFC_S                                                1

// Field:     [0] RCOSCHFC
//
// Writing 1 to this field clears the RCOSCHF raw interrupt status. Writing 0
// has no effect.
#define PRCM_OSCICR_RCOSCHFC                                        0x00000001
#define PRCM_OSCICR_RCOSCHFC_BITN                                            0
#define PRCM_OSCICR_RCOSCHFC_M                                      0x00000001
#define PRCM_OSCICR_RCOSCHFC_S                                               0


#endif // __PRCM__
